app/sidekiq/s3_uploader_worker.rb

SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def perform(doc_id, filename, filepath)
    s3 = Aws::S3::Resource.new
    s3.bucket(ENV['S3_BUCKET']).object("Uploads/#{filename}").upload_file(filepath)
  rescue => e
    doc = Document.find_by(id: doc_id)