app/controllers/documents_controller.rb

INSERT INTO "documents" ("name", "s3_url", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["name", nil], ["s3_url", nil], ["created_at", "2023-11-15 06:04:28.920610"], ["updated_at", "2023-11-15 06:04:28.920610"]]
INSERT INTO "documents" ("name", "s3_url", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"
UPDATE "documents" SET "name" = ?, "s3_url" = ?, "updated_at" = ? WHERE "documents"."id" = ?  [["name", "world hello"], ["s3_url", "https://s3.amazonaws.com/rently-kingsmen-dev/Screenshot from 2023-11-08 06-34-43.png"], ["updated_at", "2023-11-15 07:16:45.655104"], ["id", 9]]
---
  def create
    document = Document.create
    filename = params[:document].original_filename.gsub(/[\/]/, '_')
    document.name = params[:name]
    document.s3_url = "https://s3.amazonaws.com/#{ENV['S3_BUCKET']}/Uploads/#{filename}"
    if document.save

SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def show
    document = Document.find_by(id: params[:id])

SELECT "documents".* FROM "documents" WHERE "documents"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "documents" WHERE "documents"."id" = ?  [["id", 1]]
---
  def destroy
    document = Document.find_by(id: params[:id])
    return render json: { message: 'Document not found.' }, status: :ok if document.nil?

    document.destroy

SELECT "documents".* FROM "documents" WHERE (9) LIMIT ?  [["LIMIT", 1]]
---
  def fetch_documents
    Document.all